#хз зачем на это тратить время, но пусть будет
from math import *
"""a = 1920 * 1920
k = ceil(log2(16384))
d = 1_474_560 * 280
print(d / (a * k))"""

"""a = 524_288 * 320 / (1024 * 2048 * ceil(log2(1024)))
print(a)"""
"""
a = 1024 * 1024 * 32
for i in range(1, 10000):
    if (a * i) / 1_474_560 <= 120:
        print(2**i)
"""
# a = 1024 * 512 * 256
# for i in range(1, 1000):
#     if (a * i) / 6_393_911 <= 160:
#         print(2**i)

#Уничтожено

#я вернулся ёпта

# a = 1024 * 768 * 23 * 100
# b = 800 * 600 * 22 * 100
# print(752793600 / 8 / 1024)

# print(12 * 1024 * 1024 * 8 / (2 * 6 * 195))
# # print(645 / 60)
# print(3794841600 / 245839600)
print(4 * 20 * 60 * 192000 * 24) # 22118400000bit
print(12800 * 10 * 60) #7680000 bit
print(22118400000 / 7680000)